12/data/attachments/1dd6108a357a13b0.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_9ce3a6ad-9246-4407-b9d1-aa9353a348ec</nif:username>
            <nif:friendToBeAdded>Michael_car_Actions_21957_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>